sysclock/UserKeyTool/mcu/脉搏测量/polling_UI/MK64F12/drivers/fsl_dspi.c
//                DSPI_ClearStatusFlags(base, kDSPI_TxFifoFillRequestFlag);
//                remainingSendByteCount = 0;

//                while (remainingReceiveByteCount > 0)
//                {
//                    if (DSPI_GetStatusFlags(base) & kDSPI_RxFifoDrainRequestFlag)
//                    {
//                        wordReceived = DSPI_ReadData(base);

//                        if (remainingReceiveByteCount != 1)
//                        {
//                            if (rxData != NULL)
//                            {
//                                *(rxData) = wordReceived;
//                                ++rxData;
//                                *(rxData) = wordReceived >> 8;
//                                ++rxData;
//                            }
//                            remainingReceiveByteCount -= 2;
//                        }
//                        else
//                        {
//                            if (rxData != NULL)
//                            {
//                                *(rxData) = wordReceived;
//                                ++rxData;
//                            }
//                            remainingReceiveByteCount--;
//                        }
//                        DSPI_ClearStatusFlags(base, kDSPI_RxFifoDrainRequestFlag);
//                    }
//                }
//            }
//            else
//            {
//                /*Wait until Tx Fifo is not full*/
//                while (!(DSPI_GetStatusFlags(base) & kDSPI_TxFifoFillRequestFlag))
//                {
//                    DSPI_ClearStatusFlags(base, kDSPI_TxFifoFillRequestFlag);
//                }

//                if (txData != NULL)
//                {
//                    wordToSend = *(txData);
//                    ++txData;
//                    wordToSend |= (unsigned)(*(txData)) << 8U;
//                    ++txData;
//                }
//                else
//                {
//                    wordToSend = dummyData;
//                }
//                base->PUSHR = command | wordToSend;
//                remainingSendByteCount -= 2;

//                DSPI_ClearStatusFlags(base, kDSPI_TxFifoFillRequestFlag);

//                while (((remainingReceiveByteCount - remainingSendByteCount) / 2) >= fifoSize)
//                {
//                    if (DSPI_GetStatusFlags(base) & kDSPI_RxFifoDrainRequestFlag)
//                    {
//                        wordReceived = DSPI_ReadData(base);

//                        if (rxData != NULL)
//                        {
//                            *rxData = wordReceived;
//                            ++rxData;
//                            *rxData = wordReceived >> 8;
//                            ++rxData;
//                        }
//                        remainingReceiveByteCount -= 2;

//                        DSPI_ClearStatusFlags(base, kDSPI_RxFifoDrainRequestFlag);
//                    }
//                }
//            }
//        }
//    }

    return kStatus_Success;
}

static void DSPI_MasterTransferPrepare(SPI_Type *base, dspi_master_handle_t *handle, dspi_transfer_t *transfer)
{
    assert(handle);
    assert(transfer);

    dspi_command_data_config_t commandStruct;

    DSPI_StopTransfer(base);
    DSPI_FlushFifo(base, true, true);
    DSPI_ClearStatusFlags(base, kDSPI_AllStatusFlag);

    commandStruct.whichPcs =
        (dspi_which_pcs_t)(1U << ((transfer->configFlags & DSPI_MASTER_PCS_MASK) >> DSPI_MASTER_PCS_SHIFT));
    commandStruct.isEndOfQueue = false;
    commandStruct.clearTransferCount = false;
    commandStruct.whichCtar =
        (dspi_ctar_selection_t)((transfer->configFlags & DSPI_MASTER_CTAR_MASK) >> DSPI_MASTER_CTAR_SHIFT);
    commandStruct.isPcsContinuous = (bool)(transfer->configFlags & kDSPI_MasterPcsContinuous);
    handle->command = DSPI_MasterGetFormattedCommand(&(commandStruct));

    commandStruct.isEndOfQueue = true;
    commandStruct.isPcsContinuous = (bool)(transfer->configFlags & kDSPI_MasterActiveAfterTransfer);
    handle->lastCommand = DSPI_MasterGetFormattedCommand(&(commandStruct));

    handle->bitsPerFrame = ((base->CTAR[commandStruct.whichCtar] & SPI_CTAR_FMSZ_MASK) >> SPI_CTAR_FMSZ_SHIFT) + 1;

    if ((base->MCR & SPI_MCR_DIS_RXF_MASK) || (base->MCR & SPI_MCR_DIS_TXF_MASK))
    {
        handle->fifoSize = 1;
    }
    else
    {
        handle->fifoSize = FSL_FEATURE_DSPI_FIFO_SIZEn(base);
    }
    handle->txData = transfer->txData;
    handle->rxData = transfer->rxData;
    handle->remainingSendByteCount = transfer->dataSize;
    handle->remainingReceiveByteCount = transfer->dataSize;
    handle->totalByteCount = transfer->dataSize;
}

status_t DSPI_MasterTransferNonBlocking(SPI_Type *base, dspi_master_handle_t *handle, dspi_transfer_t *transfer)
{
    assert(handle);
    assert(transfer);

    /* If the transfer count is zero, then return immediately.*/
    if (transfer->dataSize == 0)
    {
        return kStatus_InvalidArgument;
    }

    /* Check that we're not busy.*/
    if (handle->state == kDSPI_Busy)
    {
        return kStatus_DSPI_Busy;
    }

    handle->state = kDSPI_Busy;

    DSPI_MasterTransferPrepare(base, handle, transfer);
    DSPI_StartTransfer(base);

    /* Enable the NVIC for DSPI peripheral. */
    EnableIRQ(s_dspiIRQ[DSPI_GetInstance(base)]);

    DSPI_MasterTransferFillUpTxFifo(base, handle);

    /* RX FIFO Drain request: RFDF_RE to enable RFDF interrupt
    * Since SPI is a synchronous interface, we only need to enable the RX interrupt.
    * The IRQ handler will get the status of RX and TX interrupt flags.
    */
    s_dspiMasterIsr = DSPI_MasterTransferHandleIRQ;

    DSPI_EnableInterrupts(base, kDSPI_RxFifoDrainRequestInterruptEnable);

    return kStatus_Success;
}

status_t DSPI_MasterTransferGetCount(SPI_Type *base, dspi_master_handle_t *handle, size_t *count)
{
    assert(handle);

    if (!count)
    {
        return kStatus_InvalidArgument;
    }

    /* Catch when there is not an active transfer. */
    if (handle->state != kDSPI_Busy)
    {
        *count = 0;
        return kStatus_NoTransferInProgress;
    }

    *count = handle->totalByteCount - handle->remainingReceiveByteCount;
    return kStatus_Success;
}

static void DSPI_MasterTransferComplete(SPI_Type *base, dspi_master_handle_t *handle)
{
    assert(handle);

    /* Disable interrupt requests*/
    DSPI_DisableInterrupts(base, kDSPI_RxFifoDrainRequestInterruptEnable | kDSPI_TxFifoFillRequestInterruptEnable);

